EDT.СЭ_Доработки/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc59acc3-f1f7-4e3f-96da-e580f2c5a88f">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="a7960b9f-ea36-440d-a2dc-d0705898776b">
    <name>СЭ_РазрешеноИспользование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d8e62251-6183-4bfa-9d13-7718495c5a33">
    <name>СЭ_Наименование</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="722c3d13-753d-4b4f-82b9-d41340f96d79">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="de093282-cec7-4174-b91e-af372311a4bc">
    <name>ЕстьТоварыДругогоКачества</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8f47dae2-8c5c-46b9-bc7f-70aa6ad06dde">
    <name>ПродукцияМаркируемаяДляГИСМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="490b5d9e-aae3-4fb8-b344-cbdbb5fccbab">
    <name>ВестиУчетСертификатовНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

EDT.СЭ_Доработки/src/CommonModules/РаботаСНоменклатуройУТ/Module.bsl
&ИзменениеИКонтроль("ПолучитьДополненныйЗапросДинамическогоСписка")
Процедура СЭ_ПолучитьДополненныйЗапросДинамическогоСписка(ТекстЗапроса)
	ТекстЗапроса =

	"ВЫБРАТЬ   
	#Вставка
    |РАЗРЕШЕННЫЕ
	|	ИнформацияОДоступности.Номенклатура КАК Номенклатура,
	|	ИнформацияОДоступности.ВНаличииОстаток КАК ВНаличииОстаток
	|ПОМЕСТИТЬ ЗапасыИПотребности
	|ИЗ
	|	РегистрНакопления.ЗапасыИПотребности.Остатки(, Склад ССЫЛКА Справочник.Склады) КАК ИнформацияОДоступности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыКОтгрузке.Номенклатура КАК Номенклатура,
	|	ТоварыКОтгрузке.КОтгрузкеОстаток КАК КОтгрузкеОстаток
	|ПОМЕСТИТЬ ТоварыКОтгрузке
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(, ) КАК ТоварыКОтгрузке
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыКОтгрузке.Номенклатура КАК Номенклатура,
	|	ТоварыКОтгрузке.КОтгрузкеОстаток КАК Отгружается,
	|	0 КАК ВНаличии,
	|	0 КАК ВРезерве
	|ПОМЕСТИТЬ ТаблицаДанныхОтчета
	|ИЗ
	|	ТоварыКОтгрузке КАК ТоварыКОтгрузке
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИнформацияОДоступности.Номенклатура,
	|	0,
	|	0,
	|	ИнформацияОДоступности.Зарезервировано
	|ИЗ
	|	РегистрСведений.РаспределениеЗапасов КАК ИнформацияОДоступности
	|ГДЕ
	|	ИнформацияОДоступности.Состояние В (ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе), ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемоеПоступление), ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченНаСкладе), ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ЗарезервированПриПоступлении), ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОбеспеченКДате), ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.Обеспечить), ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ВРезерве))
	|	И (ИнформацияОДоступности.Зарезервировано <> 0
	|			ИЛИ ИнформацияОДоступности.НеОбеспечено <> 0
	|			ИЛИ ИнформацияОДоступности.Свободно <> 0)
	|	И ИнформацияОДоступности.Склад ССЫЛКА Справочник.Склады
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИнформацияОДоступности.Номенклатура,
	|	0,
	|	ИнформацияОДоступности.ВНаличииОстаток,
	|	0
	|ИЗ
	|	ЗапасыИПотребности КАК ИнформацияОДоступности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанныхОтчета.Номенклатура КАК Номенклатура,
	|	СУММА(ТаблицаДанныхОтчета.ВНаличии) + СУММА(ТаблицаДанныхОтчета.Отгружается) КАК ВНаличии,
	|	СУММА(ТаблицаДанныхОтчета.ВРезерве) КАК ВРезерве
	|ПОМЕСТИТЬ ТаблицаДанныхОтчетаИтог
	|ИЗ
	|	ТаблицаДанныхОтчета КАК ТаблицаДанныхОтчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДанныхОтчета.Номенклатура ;
	|////////////////////////////////////////////////// 
	| ВЫБРАТЬ РАЗРЕШЕННЫЕ
	#КонецВставки
	|	СпрНоменклатура.Ссылка КАК Ссылка,
	|	СпрНоменклатура.Код КАК Код,
	|	СпрНоменклатура.Наименование КАК Наименование,
	|	СпрНоменклатура.Артикул КАК Артикул,
	|	СпрНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СпрНоменклатура.СтавкаНДС КАК СтавкаНДС,
	|	СпрНоменклатура.Родитель КАК Родитель,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ЕстьТоварыДругогоКачества
	|			ТОГДА 4 + ВЫБОР
	|					КОГДА СпрНоменклатура.ПометкаУдаления
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ + ВЫБОР
	|					КОГДА СпрНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
	|						ТОГДА 0
	|					ИНАЧЕ 2
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СпрНоменклатура.ПометкаУдаления
	|					ТОГДА 1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|			+ ВЫБОР
	|						КОГДА СпрНоменклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
	|							ТОГДА 0
	|						ИНАЧЕ 2
	|					КОНЕЦ
	|	КОНЕЦ КАК ИндексКартинки,
	|	
	|	// ЭлектронноеВзаимодействие.РаботаСНоменклатурой
	|    
	|    ВЫБОР
	|        КОГДА СоответствиеНоменклатурыРаботаСНоменклатурой.СтатусСопоставления = &Сопоставлено
	|            ТОГДА СоответствиеНоменклатурыРаботаСНоменклатурой.ПредставлениеНоменклатурыСервиса
	|        КОГДА СоответствиеНоменклатурыРаботаСНоменклатурой.СтатусСопоставления = &НеСопоставлено
	|                И СоответствиеНоменклатурыРаботаСНоменклатурой.КоличествоВариантов > 0
	|            ТОГДА ВЫРАЗИТЬ(&СтрокаНайденыВарианты КАК СТРОКА(256))
	|        КОГДА СоответствиеНоменклатурыРаботаСНоменклатурой.СтатусСопоставления В (&СтатусыНайдено)
	|            ТОГДА ВЫРАЗИТЬ(&СтрокаНайдено КАК СТРОКА(256)) + ВЫРАЗИТЬ(СоответствиеНоменклатурыРаботаСНоменклатурой.ПредставлениеНоменклатурыСервиса КАК СТРОКА(1024))
	|        ИНАЧЕ ВЫРАЗИТЬ(&СтрокаСопоставить КАК СТРОКА(256))
	|    КОНЕЦ КАК НоменклатураРаботаСНоменклатурой,
	|    ВЫБОР
	|        КОГДА СоответствиеНоменклатурыРаботаСНоменклатурой.КоличествоВариантов > 0
	|                ИЛИ СоответствиеНоменклатурыРаботаСНоменклатурой.СтатусСопоставления В (&СтатусыНайдено)
	|            ТОГДА 1
	|        КОГДА СоответствиеНоменклатурыРаботаСНоменклатурой.СтатусСопоставления = &Сопоставлено
	|            ТОГДА 
	|                ВЫБОР 
	|                    КОГДА СоответствиеНоменклатурыРаботаСНоменклатурой.РежимЗагрузкиХарактеристик = &Сопоставление 
	|                        ТОГДА 3
	|                    ИНАЧЕ 2 
	|                КОНЕЦ
	|        ИНАЧЕ 0
	|    КОНЕЦ КАК КодСтатусаСопоставленияРаботаСНоменклатурой,
	|    СоответствиеНоменклатурыРаботаСНоменклатурой.ИдентификаторНоменклатурыСервиса КАК ИдентификаторНоменклатурыРаботаСНоменклатурой,
	|    ВЫБОР
	|        КОГДА СоответствиеНоменклатурыРаботаСНоменклатурой.ОбновляетсяАвтоматически
	|            ТОГДА 1
	|        ИНАЧЕ 0
	|    КОНЕЦ КАК КартинкаРежимаОбновленияРаботаСНоменклатурой
	|    
	|    // Конец ЭлектронноеВзаимодействие.РаботаСНоменклатурой
	|	
	#Вставка
	|, 
	|ЕСТЬNULL(ТаблицаДанныхОтчетаИтог.ВНаличии,0) КАК Наличие,
	|ЕСТЬNULL(ТаблицаДанныхОтчетаИтог.ВРезерве,0) КАК Резерв
    #КонецВставки

	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|	
	|        // ЭлектронноеВзаимодействие.РаботаСНоменклатурой
	|        
	|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыРаботаСНоменклатурой КАК СоответствиеНоменклатурыРаботаСНоменклатурой
	|        ПО СпрНоменклатура.Ссылка = СоответствиеНоменклатурыРаботаСНоменклатурой.Номенклатура
	|            И (СоответствиеНоменклатурыРаботаСНоменклатурой.Характеристика = &ПустаяХарактеристика)
	|        
	|        // Конец ЭлектронноеВзаимодействие.РаботаСНоменклатурой
	#Вставка
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхОтчетаИтог КАК ТаблицаДанныхОтчетаИтог
	|	ПО ТаблицаДанныхОтчетаИтог.Номенклатура = СпрНоменклатура.Ссылка
    #КонецВставки
	|	
	|ГДЕ
	|	НЕ СпрНоменклатура.ЭтоГруппа
	|{ГДЕ
	|	(СпрНоменклатура.Ссылка В
	|			(ВЫБРАТЬ
	|				Сегменты.Номенклатура
	|			ИЗ
	|				РегистрСведений.НоменклатураСегмента КАК Сегменты
	|			ГДЕ
	|				Сегменты.Сегмент = &СегментНоменклатуры))}";

КонецПроцедуры
